[
  {
    "id": 1,
    "projectName": "NextGen Hunt",
    "image": "https://i.ibb.co.com/Qv5L73VC/nextgtch.png",
    "description": "NextGen Hunt is a platform where users can discover and share the latest technology, including web apps, AI tools, software, games, and mobile apps. It features role-based access (User, Moderator, Admin) and offers functionalities such as voting, reporting, product reviews, dashboard management, and coupon system integration. The site is fully responsive and provides a seamless user experience.",
    "liveProjectLink": {
      "client": "https://spectacular-praline-76df24.netlify.app/"
    },
    "githubRepositoryLink": "https://github.com/AsifurRahman10/NextGenHunt-website",
    "technologyStack": {
      "frontend": [
        "React",
        "React Router",
        "React Hook Form",
        "Swiper",
        "Recharts",
        "Lottie",
        "Axios",
        "SweetAlert2",
        "Firebase Authentication",
        "nodemailer"
      ],
      "backend": ["Node.js", "Express.js"],
      "toolsAndLibraries": [
        "Stripe",
        "React Helmet Async",
        "React DND",
        "React Icons",
        "TanStack React Query",
        "Moment.js"
      ]
    },
    "challengesFaced": [
      "Implementing role-based access control and ensuring different user roles had the correct permissions.",
      "Managing product submissions and approvals efficiently.",
      "Integrating the coupon system while maintaining security and preventing misuse.",
      "Handling real-time updates and smooth user experience for voting and reporting features."
    ],
    "potentialImprovementsAndFuturePlans": [
      "Enhancing the UI/UX with more interactive elements.",
      "Adding a notifications system to alert users about important updates.",
      "Implementing AI-based recommendations for featured and trending products.",
      "Improving search functionality with better filters and tag-based recommendations."
    ]
  },
  {
    "id": 2,
    "projectName": "ArtifactArcade",
    "image": "https://i.ibb.co.com/8ngKRKRz/ac.png",
    "description": "ArtifactArcade is a web application dedicated to tracking historical artifacts like the Rosetta Stone and Antikythera Mechanism. It allows users to explore, view details, and contribute their own artifact entries, fostering a community-driven repository of historical knowledge. Users can interact by liking or disliking artifacts, and authentication ensures secure access to various features.",
    "liveProjectLink": {
      "client": "https://artifactarcade-website.web.app/"
    },
    "githubRepositoryLink": "https://github.com/AsifurRahman10/ArtifactArcade-website-client",
    "technologyStack": {
      "frontend": [
        "React",
        "React Router DOM",
        "React Hook Form",
        "Flowbite React",
        "Axios",
        "Lottie React",
        "Motion",
        "React Helmet Async",
        "React Icons",
        "React Slick & Slick Carousel",
        "SweetAlert2"
      ],
      "backend": ["Node.js", "Express.js", "MongoDB"],
      "toolsAndLibraries": [
        "Firebase Authentication",
        "Nodemailer",
        "TanStack React Query",
        "Moment.js"
      ]
    },
    "challengesFaced": [
      "Managing private routes to ensure only authenticated users can contribute or interact with artifacts.",
      "Optimizing API requests using Axios to handle fetching and submitting user-generated content efficiently.",
      "Implementing a seamless like/dislike system while preventing multiple interactions from the same user.",
      "Ensuring responsive design across various devices without breaking the layout."
    ],
    "potentialImprovementsAndFuturePlans": [
      "Implementing a search and filtering system to help users find specific artifacts quickly.",
      "Adding a comment section where users can discuss artifacts.",
      "Integrating a backend database for storing artifacts instead of relying on Firebase alone.",
      "Enhancing the UI with more dynamic animations for a richer experience."
    ]
  },
  {
    "id": 3,
    "projectName": "VisaEase",
    "image": "https://i.ibb.co.com/5XgwPXnT/li.png",
    "description": "VisaEase is a user-friendly Visa Navigator Portal designed to simplify visa management for travelers. Users can check visa requirements, view detailed visa information, apply for visas online, and track their applications effortlessly. The platform offers dynamic visa management for both users and administrators, ensuring an efficient and feature-rich experience. The website is fully responsive, optimized for desktops, tablets, and smartphones.",
    "liveProjectLink": {
      "client": "https://visaease-web.netlify.app/",
      "server": "https://visaease-server.vercel.app/"
    },
    "githubRepositoryLink": "https://github.com/AsifurRahman10/VisaEase-Visa-Navigator-Portal-client",
    "technologyStack": {
      "frontend": [
        "React",
        "Tailwind CSS",
        "Daisy UI",
        "AOS (Animate on Scroll)",
        "Lottie-React",
        "React Helmet Async",
        "React Icons",
        "React Simple Typewriter",
        "SweetAlert2",
        "Swiper"
      ],
      "backend": ["Node.js", "Express.js", "MongoDB"],
      "toolsAndLibraries": ["Firebase Authentication"]
    },
    "challengesFaced": [
      "Implementing private routes to ensure secure access to visa-related features.",
      "Managing visa applications efficiently, including updating and canceling applications.",
      "Optimizing API requests for a seamless experience when filtering and searching visas.",
      "Ensuring responsiveness and smooth animations across all devices."
    ],
    "potentialImprovementsAndFuturePlans": [
      "Enhancing the UI/UX with more engaging and interactive components.",
      "Adding a real-time visa processing status tracker for users.",
      "Integrating AI-based recommendations for visa options based on travel history.",
      "Expanding the visa database with more countries and visa types."
    ]
  },
  {
    "id": 4,
    "projectName": "Lingo-Bingo",
    "image": "https://i.ibb.co.com/kgNTRcLL/li.png",
    "description": "Lingo-Bingo is an interactive e-learning platform designed to make learning the German language fun and accessible. With a rich vocabulary bank, expert support, and engaging lessons, users can master German at their own pace. The platform features structured lessons, pronunciation guides, and tutorial videos to enhance the learning experience.",
    "liveProjectLink": "https://lingobingogerman.netlify.app/",
    "githubRepositoryLink": "https://github.com/YourGitHubUsername/Lingo-Bingo",
    "technologyStack": {
      "frontend": [
        "React",
        "Tailwind CSS",
        "Daisy UI",
        "AOS (Animate on Scroll)",
        "React Router DOM",
        "React Helmet Async",
        "React Icons",
        "React Spinners"
      ],
      "backend": ["Firebase Authentication"],
      "toolsAndLibraries": []
    },
    "challengesFaced": [
      "Implementing private routes to restrict access to lessons and tutorials.",
      "Managing authentication flow, including seamless redirection after login.",
      "Ensuring a smooth and engaging UI/UX with animations and interactive elements."
    ],
    "potentialImprovementsAndFuturePlans": [
      "Expanding the vocabulary bank with more words and phrases.",
      "Adding AI-powered pronunciation analysis for better learning feedback.",
      "Introducing gamification elements such as quizzes and badges.",
      "Enhancing the tutorials section with more interactive video lessons."
    ]
  }
]
